import { Grid, Typography } from '@mui/material'
import React from 'react'
import Astar from '../../assets/image/astera-logo.jpg'
import AstraWordPress from '../../assets/image/Astra-wordpress-pic.jpg'
import AstraPic2 from '../../assets/image/astera-pic-2.jpg'


const Body = () => {


    const list = [
        { id: 1, image: Astar, title: "قالب وردپرسی Astra یکی از پرکاربردترین و محبوبترین قالب های وردپرس است که توسط شرکت Brainstorm Force توسعه داده شده است. این قالب با طراحی ساده و کاربرپسندی، قابلیت های فراوان و سرعت بالا به کاربران ارائه می دهد.        " },
        { id: 2, image: AstraWordPress, title: "یکی از ویژگی های منحصر به فرد Astra، قابلیت سفارشی سازی بالاست. این قالب دارای صفحه ساز هوشمند Astra است که به کاربران این امکان را می دهد که به سادگی صفحات خود را طراحی و سفارشی کنند. همچنین، Astra با توجه به نیاز کاربران، افزونه های متعددی را پشتیبانی می کند و با ووکامرس، یکی از بهترین قالب های فروشگاهی وردپرس است." },
        { id: 3, image: AstraPic2, title: "به دلیل بهینه سازی بالای سرعت، Astra به عنوان یکی از بهترین قالب های سئویی برای وردپرس شناخته شده است. این قالب دارای نسخه رایگان و نسخه پرمیوم با ویژگی های بیشتر و قابلیت های پیشرفته تر است." },
        { id: 4, image: AstraPic2, title: "در کل، Astra یک قالب وردپرسی بسیار قوی، سریع و کاربرپسند است که به دلیل قابلیت های فراوان و سفارشی سازی بالا، به شدت پرطرفدار و محبوب است." },
    ]



    return (
        <Grid pt={"65px"} display={"flex"} justifyContent={"center"} alignItems={"center"} >
            <Grid width={{xs:"90%" , md:"250%"}} boxShadow={5} borderRadius={"16px"} pr={{xs:"20px" , md:"40px"}} pt={"65px"} >
                <Grid pb={"32px"}>
                    <Typography color={"#FF5500"} fontSize={{xs:"24px" , md:"32px"}} fontWeight={"bold"} >قالب وردپرس استرا</Typography>
                </Grid>
                <Grid>
                    {
                        list.map(item =>
                            <Grid pb={"32px"} key={item.id} >
                                <Typography pb={"32px"} fontSize={{ xs: "18px", md: "24px" }} width={"90%"}>{item.title}</Typography>
                                <img width={"90%"} src={item.image} alt="pic" />
                            </Grid>
                        )
                    }
                </Grid>
                <Grid width={"90%"}>
                    <Typography pb={"32px"} fontSize={"24px"} fontWeight={"bold"}>مزایای استفاده از قالب وردپرسی استرا</Typography>
                    <Typography fontSize={{xs:"20px" , md:"24px"}} pb={"32px"}>
                        استفاده از قالب وردپرسی Astra، به دلیل ویژگی های بسیاری که دارد، بسیار مفید و مزیت های بسیاری دارد. در زیر به برخی از مزایای استفاده از این قالب اشاره می کنیم:<br />
                        1.سرعت بالا: Astra یکی از قالب هایی است که بسیار بهینه شده و سرعت بالایی دارد. سرعت بالا این قالب باعث بهبود تجربه کاربری و همچنین بهبود سئو و رتبه بندی سایت در موتورهای جستجو می شود.
                        2.سفارشی سازی آسان: Astra قابلیت های بسیاری برای سفارشی سازی طرح و امکانات را فراهم می کند. همچنین دارای صفحه ساز قدرتمندی است که به کاربران این امکان را می دهد تا صفحات خود را بدون نیاز به دانش فنی طراحی کنند.<br />
                        3.پشتیبانی از ووکامرس: Astra یکی از بهترین قالب های فروشگاهی وردپرس است و به صورت کامل با ووکامرس هماهنگ شده است. این قالب قابلیت های فراوانی برای طراحی فروشگاه های آنلاین دارد.<br />
                        4.طراحی ریسپانسیو: طراحی ریسپانسیو از جمله ویژگی های مهم Astra است که سایت شما را برای تمامی دستگاه های مختلف (موبایل، تبلت و دسکتاپ) بهینه می کند.<br />
                        5.پشتیبانی از افزونه های متعدد: Astra با افزونه های متعددی هماهنگ شده است که به کاربران این امکان را می دهند تا قابلیت های خاصی را به سایت خود اضافه کنند.<br />
                        6.به روز رسانی مداوم: تیم توسعه دهنده Astra به طور منظم این قالب را به روزرسانی می کند و امکانات جدیدی را به وزرسانی می کند.
                    </Typography>
                </Grid>
            </Grid>
        </Grid>
    )
}

export default Body